export const regEx = {
  // regex
  fields: {
    text: /^[a-zA-Z0-9ñÑáéíóúÁÉÍÓÚ\s]+$/,
    // email: /^[a-z0-9._%+-]+@[a-z0-9.-]+\.[a-z]{2,4}$/,
    email: /(?:[a-z0-9!#$%&'*+/=?^_`{|}~-]+(?:\.[a-z0-9!#$%&'*+/=?^_`{|}~-]+)*|"(?:[\x01-\x08\x0b\x0c\x0e-\x1f\x21\x23-\x5b\x5d-\x7f]| \\[\x01-\x09\x0b\x0c\x0e-\x7f])*")@(?:(?:[a-z0-9](?:[a-z0-9-]*[a-z0-9])?\.)+[a-z0-9](?:[a-z0-9-]*[a-z0-9])?| \[(?:(?:25[0-5]|2[0-4][0-9]|[01]?[0-9][0-9]?)\.){3}(?:25[0-5]|2[0-4][0-9]|[01]?[0-9][0-9]?|[a-z0-9-]*[a-z0-9]: (?:[\x01-\x08\x0b\x0c\x0e-\x1f\x21-\x5a\x53-\x7f]|\\[\x01-\x09\x0b\x0c\x0e-\x7f])+)\])/,
    password: /^(?=.*[a-z])(?=.*[A-Z])(?=.*\d)[a-zA-Z\d]{8,}$/,
    curp: /^[A-Z]{1}[AEIOU]{1}[A-Z]{2}[0-9]{2}[0-1]{1}[0-9]{1}[0-3]{1}[0-9]{1}[HM]{1}[A-Z]{1}[BCDFGHJKLMNÑPQRSTVWXYZ]{3}[A-Z0-9]{1}[0-9]{1}$/,
    rfc: /^(([ÑA-Z|ña-z|&]{3}|[A-Z|a-z]{4})\d{2}((0[1-9]|1[012])(0[1-9]|1\d|2[0-8])|(0[13456789]|1[012])(29|30)|(0[13578]|1[02])31)(\w{2})([A|a|0-9]{1}))$|^(([ÑA-Z|ña-z|&]{3}|[A-Z|a-z]{4})([02468][048]|[13579][26])0229)(\w{2})([A|a|0-9]{1})$/,
    nss: /^[0-9]{11}$/,
    phone: /^\d{10}$/,
    date: /^\d{4}-\d{2}-\d{2}$/,
  },

  // exaples of diferent mexicans rfcs
  physicalPersonsRfc: [
    {
      1: 'SOZM991110GJ1',
      2: 'GOVM860812QA2',
      3: 'JACL841028Q62',
      4: 'MOMM770119F65',
      5: 'GORJ8608234G3',
      6: 'RIPF800312AZ0',
    },
  ],
  // examples of diferent mexicans curps
  physicalPersonsCurp: [
    {
      1: 'SOZM991110HDFLRR09',
      2: 'GOVM860812HDFLRR09',
      3: 'JACL841028HDFLRR09',
      4: 'MOMM770119HDFLRR09',
    },
  ],
};